package main
import "fmt"
func main(){
	//遍历，决定处理地几行
	for y := 1; y <= 9;y++{
		//遍历。决定多少列
		for x := 1; x <=y; x++{
			fmt.Printf("%d*%d=%d ",x,y, x*y)
		}
		fmt.Println()
	}
}
/*
PS D:\golang\goproject> go run  D:\golang\goproject\src\go语言从入门到进阶实战\流程控制\九九乘法表\main.go
1*1=1 
1*2=2 2*2=4
1*3=3 2*3=6 3*3=9
1*4=4 2*4=8 3*4=12 4*4=16
1*5=5 2*5=10 3*5=15 4*5=20 5*5=25
1*6=6 2*6=12 3*6=18 4*6=24 5*6=30 6*6=36
1*7=7 2*7=14 3*7=21 4*7=28 5*7=35 6*7=42 7*7=49
1*8=8 2*8=16 3*8=24 4*8=32 5*8=40 6*8=48 7*8=56 8*8=64
1*9=9 2*9=18 3*9=27 4*9=36 5*9=45 6*9=54 7*9=63 8*9=72 9*9=81
生成1~9 数字，对应乘法表的每一行，也就是乘数
乘法表没一行中的列数随着行数增加而增加这一列的X表示有多少列
打印换行
*/